comparison/results_reprod/dsb_other/bench100/compose_orig/out_1_1651.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 2123.436ms, rate sampling interval: 5304ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.75s   168.14ms   2.21s    66.89%
    Req/Sec   335.00     17.68   355.00     33.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.76s 
 75.000%    1.84s 
 90.000%    1.98s 
 99.000%    2.21s 
 99.900%    2.39s 
 99.990%    2.41s 
 99.999%    2.41s 
100.000%    2.41s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1409.023     0.000000            1         1.00
    1528.831     0.100000          683         1.11
    1599.487     0.200000         1357         1.25
    1658.879     0.300000         2031         1.43
    1711.103     0.400000         2712         1.67
    1758.207     0.500000         3390         2.00
    1776.639     0.550000         3734         2.22
    1791.999     0.600000         4064         2.50
    1806.335     0.650000         4406         2.86
    1821.695     0.700000         4751         3.33
    1842.175     0.750000         5082         4.00
    1854.463     0.775000         5254         4.44
    1871.871     0.800000         5428         5.00
    1895.423     0.825000         5588         5.71
    1924.095     0.850000         5756         6.67
    1954.815     0.875000         5925         8.00
    1969.151     0.887500         6014         8.89
    1983.487     0.900000         6097        10.00
    1996.799     0.912500         6181        11.43
    2011.135     0.925000         6268        13.33
    2022.399     0.937500         6346        16.00
    2029.567     0.943750         6390        17.78
    2037.759     0.950000         6433        20.00
    2046.975     0.956250         6474        22.86
    2059.263     0.962500         6518        26.67
    2075.647     0.968750         6558        32.00
    2084.863     0.971875         6581        35.56
    2094.079     0.975000         6600        40.00
    2107.391     0.978125         6622        45.71
    2127.871     0.981250         6643        53.33
    2162.687     0.984375         6664        64.00
    2183.167     0.985938         6674        71.11
    2197.503     0.987500         6685        80.00
    2207.743     0.989062         6696        91.43
    2220.031     0.990625         6706       106.67
    2252.799     0.992188         6717       128.00
    2269.183     0.992969         6722       142.22
    2283.519     0.993750         6727       160.00
    2299.903     0.994531         6732       182.86
    2316.287     0.995313         6738       213.33
    2332.671     0.996094         6743       256.00
    2340.863     0.996484         6746       284.44
    2347.007     0.996875         6748       320.00
    2355.199     0.997266         6751       365.71
    2365.439     0.997656         6754       426.67
    2369.535     0.998047         6756       512.00
    2375.679     0.998242         6758       568.89
    2377.727     0.998437         6759       640.00
    2381.823     0.998633         6760       731.43
    2387.967     0.998828         6762       853.33
    2390.015     0.999023         6763      1024.00
    2394.111     0.999121         6764      1137.78
    2394.111     0.999219         6764      1280.00
    2398.207     0.999316         6765      1462.86
    2400.255     0.999414         6766      1706.67
    2400.255     0.999512         6766      2048.00
    2408.447     0.999561         6767      2275.56
    2408.447     0.999609         6767      2560.00
    2408.447     0.999658         6767      2925.71
    2412.543     0.999707         6768      3413.33
    2412.543     0.999756         6768      4096.00
    2412.543     0.999780         6768      4551.11
    2412.543     0.999805         6768      5120.00
    2412.543     0.999829         6768      5851.43
    2414.591     0.999854         6769      6826.67
    2414.591     1.000000         6769          inf
#[Mean    =     1752.369, StdDeviation   =      168.138]
#[Max     =     2412.544, Total count    =         6769]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9007 requests in 30.00s, 1.85MB read
Requests/sec:    300.26
Transfer/sec:     63.04KB