comparison/results_reprod/dsb_other/bench100/compose_orig/out_1_2451.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 1 connections
  Thread calibration: mean lat.: 1652.310ms, rate sampling interval: 4151ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.08s   332.18ms   3.17s    83.17%
    Req/Sec   282.00     29.86   309.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.02s 
 75.000%    2.14s 
 90.000%    2.40s 
 99.000%    3.17s 
 99.900%    3.24s 
 99.990%    3.26s 
 99.999%    3.27s 
100.000%    3.27s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1646.591     0.000000            1         1.00
    1776.639     0.100000          571         1.11
    1845.247     0.200000         1138         1.25
    1903.615     0.300000         1704         1.43
    1960.959     0.400000         2274         1.67
    2015.231     0.500000         2846         2.00
    2042.879     0.550000         3128         2.22
    2071.551     0.600000         3419         2.50
    2097.151     0.650000         3699         2.86
    2121.727     0.700000         3996         3.33
    2144.255     0.750000         4271         4.00
    2160.639     0.775000         4415         4.44
    2185.215     0.800000         4550         5.00
    2220.031     0.825000         4694         5.71
    2260.991     0.850000         4833         6.67
    2312.191     0.875000         4974         8.00
    2347.007     0.887500         5044         8.89
    2404.351     0.900000         5113        10.00
    2766.847     0.912500         5184        11.43
    2846.719     0.925000         5254        13.33
    2914.303     0.937500         5325        16.00
    2949.119     0.943750         5361        17.78
    2979.839     0.950000         5398        20.00
    3006.463     0.956250         5434        22.86
    3031.039     0.962500         5467        26.67
    3059.711     0.968750         5504        32.00
    3074.047     0.971875         5522        35.56
    3088.383     0.975000         5541        40.00
    3100.671     0.978125         5558        45.71
    3115.007     0.981250         5574        53.33
    3135.487     0.984375         5594        64.00
    3143.679     0.985938         5602        71.11
    3151.871     0.987500         5609        80.00
    3162.111     0.989062         5618        91.43
    3172.351     0.990625         5629       106.67
    3180.543     0.992188         5637       128.00
    3186.687     0.992969         5641       142.22
    3190.783     0.993750         5645       160.00
    3194.879     0.994531         5649       182.86
    3203.071     0.995313         5655       213.33
    3209.215     0.996094         5659       256.00
    3213.311     0.996484         5661       284.44
    3217.407     0.996875         5664       320.00
    3219.455     0.997266         5665       365.71
    3225.599     0.997656         5668       426.67
    3227.647     0.998047         5669       512.00
    3231.743     0.998242         5671       568.89
    3235.839     0.998437         5672       640.00
    3239.935     0.998633         5673       731.43
    3241.983     0.998828         5674       853.33
    3246.079     0.999023         5675      1024.00
    3250.175     0.999121         5676      1137.78
    3250.175     0.999219         5676      1280.00
    3254.271     0.999316         5677      1462.86
    3254.271     0.999414         5677      1706.67
    3256.319     0.999512         5678      2048.00
    3256.319     0.999561         5678      2275.56
    3256.319     0.999609         5678      2560.00
    3262.463     0.999658         5679      2925.71
    3262.463     0.999707         5679      3413.33
    3262.463     0.999756         5679      4096.00
    3262.463     0.999780         5679      4551.11
    3262.463     0.999805         5679      5120.00
    3266.559     0.999829         5680      5851.43
    3266.559     1.000000         5680          inf
#[Mean    =     2084.448, StdDeviation   =      332.183]
#[Max     =     3264.512, Total count    =         5680]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8759 requests in 30.00s, 1.80MB read
Requests/sec:    291.95
Transfer/sec:     61.30KB