comparison/results_reprod/dsb_other/bench100/compose_orig/out_2_3251.log
Running 30s test @ http://192.168.1.74:8080/wrk2-api/post/compose
  1 threads and 2 connections
  Thread calibration: mean lat.: 1794.305ms, rate sampling interval: 4923ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.48s   185.09ms   2.79s    62.29%
    Req/Sec   454.25      2.28   458.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.49s 
 75.000%    2.63s 
 90.000%    2.73s 
 99.000%    2.79s 
 99.900%    2.81s 
 99.990%    2.82s 
 99.999%    2.83s 
100.000%    2.83s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1889.279     0.000000            1         1.00
    2230.271     0.100000          915         1.11
    2316.287     0.200000         1833         1.25
    2383.871     0.300000         2749         1.43
    2443.263     0.400000         3662         1.67
    2494.463     0.500000         4573         2.00
    2519.039     0.550000         5034         2.22
    2545.663     0.600000         5482         2.50
    2572.287     0.650000         5928         2.86
    2600.959     0.700000         6381         3.33
    2633.727     0.750000         6823         4.00
    2652.159     0.775000         7057         4.44
    2670.591     0.800000         7292         5.00
    2686.975     0.825000         7513         5.71
    2703.359     0.850000         7743         6.67
    2717.695     0.875000         7961         8.00
    2725.887     0.887500         8099         8.89
    2732.031     0.900000         8219        10.00
    2738.175     0.912500         8331        11.43
    2744.319     0.925000         8436        13.33
    2750.463     0.937500         8534        16.00
    2754.559     0.943750         8598        17.78
    2758.655     0.950000         8656        20.00
    2762.751     0.956250         8716        22.86
    2766.847     0.962500         8771        26.67
    2770.943     0.968750         8830        32.00
    2772.991     0.971875         8853        35.56
    2775.039     0.975000         8878        40.00
    2777.087     0.978125         8898        45.71
    2779.135     0.981250         8925        53.33
    2783.231     0.984375         8965        64.00
    2785.279     0.985938         8985        71.11
    2785.279     0.987500         8985        80.00
    2787.327     0.989062         9002        91.43
    2789.375     0.990625         9019       106.67
    2791.423     0.992188         9032       128.00
    2791.423     0.992969         9032       142.22
    2793.471     0.993750         9044       160.00
    2795.519     0.994531         9056       182.86
    2795.519     0.995313         9056       213.33
    2797.567     0.996094         9062       256.00
    2799.615     0.996484         9070       284.44
    2799.615     0.996875         9070       320.00
    2799.615     0.997266         9070       365.71
    2801.663     0.997656         9073       426.67
    2803.711     0.998047         9077       512.00
    2805.759     0.998242         9080       568.89
    2805.759     0.998437         9080       640.00
    2807.807     0.998633         9084       731.43
    2807.807     0.998828         9084       853.33
    2811.903     0.999023         9087      1024.00
    2811.903     0.999121         9087      1137.78
    2811.903     0.999219         9087      1280.00
    2813.951     0.999316         9088      1462.86
    2815.999     0.999414         9089      1706.67
    2818.047     0.999512         9090      2048.00
    2820.095     0.999561         9091      2275.56
    2820.095     0.999609         9091      2560.00
    2820.095     0.999658         9091      2925.71
    2822.143     0.999707         9092      3413.33
    2822.143     0.999756         9092      4096.00
    2824.191     0.999780         9093      4551.11
    2824.191     0.999805         9093      5120.00
    2824.191     0.999829         9093      5851.43
    2824.191     0.999854         9093      6826.67
    2824.191     0.999878         9093      8192.00
    2826.239     0.999890         9094      9102.22
    2826.239     1.000000         9094          inf
#[Mean    =     2483.816, StdDeviation   =      185.091]
#[Max     =     2824.192, Total count    =         9094]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  13611 requests in 30.00s, 2.79MB read
  Non-2xx or 3xx responses: 15
Requests/sec:    453.66
Transfer/sec:     95.27KB